; domain
(define (domain housework)

    (:requirements :strips :typing :adl)

    ; Begin types
    (:types
        agent room item - object
        desk appliance - item
    )
    ; End types

    ; Begin predicates
    (:predicates
        (agent_at ?a - agent ?r - room)
        (agent_hand_free ?a - agent)
        (agent_has_item ?a - agent ?i - item)

        (item_at ?i - item ?r - room)
        (item_on ?i - item ?d - desk)
        (item_in ?i - item ?ap - appliance) 

        (item_accessible ?i - item)
        (item_pickable ?i - item)

        (appliance_on ?ap - appliance)
        (appliance_at ?ap - appliance ?r - room)

        (neighbor ?r1 - room ?r2 - room)

        (cooked ?i - item)
        (boiled ?i - item)

        (is_bread ?i - item)
        (is_toaster ?ap - appliance)
        (is_kettle ?i - item)
        (is_stove ?ap - appliance)
        (is_cup_ramen ?i - item)
        (is_water_dispenser ?ap - appliance)
        (is_desk ?d - desk)
    )
    ; End predicates

    ; Begin actions
    (:action goto
        :parameters (?a - agent ?from - room ?to - room)
        :precondition (and
            (agent_at ?a ?from)
            (neighbor ?from ?to)
        )
        :effect (and
            (not (agent_at ?a ?from))
            (agent_at ?a ?to)
        )
    )

    (:action pick_from_room
        :parameters (?a - agent ?i - item ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (item_at ?i ?r)
            (item_accessible ?i)
            (item_pickable ?i)
            (agent_hand_free ?a)
        )
        :effect (and
            (not (item_at ?i ?r))
            (not (agent_hand_free ?a))
            (agent_has_item ?a ?i)
        )
    )

    (:action pick_from_appliance
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (agent_hand_free ?a)
            (item_in ?i ?ap)
            (appliance_at ?ap ?r)
            (item_accessible ?i)
            (item_pickable ?i)
        )
        :effect (and
            (not (item_in ?i ?ap))
            (not (agent_hand_free ?a))
            (agent_has_item ?a ?i)
        )
    )

    (:action place_on_desk
        :parameters (?a - agent ?i - item ?d - desk ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (not (item_on ?i ?d))
            (agent_has_item ?a ?i)
        )
        :effect (and
            (not (agent_has_item ?a ?i))
            (agent_hand_free ?a)
            (item_on ?i ?d)
        )
    )
    
    (:action place_in_appliance
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (not (item_in ?i ?ap))
            (appliance_at ?ap ?r)
            (agent_has_item ?a ?i)
        )
        :effect (and
            (not (agent_has_item ?a ?i))
            (agent_hand_free ?a)
            (item_in ?i ?ap)
        )
    )

    (:action turn_on_appliance
        :parameters (?a - agent ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (appliance_at ?ap ?r)
            (not (appliance_on ?ap))
        )
        :effect (and
            (appliance_on ?ap)
        )
    )

    (:action turn_off_appliance
        :parameters (?a - agent ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (appliance_at ?ap ?r)
            (appliance_on ?ap)
        )
        :effect (and
            (not (appliance_on ?ap))
        )
    )

    (:action wait_cook_bread
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (item_in ?i ?ap)
            (appliance_at ?ap ?r)
            (is_toaster ?ap)
            (appliance_on ?ap)
            (not (cooked ?i))
        )
        :effect (and
            (cooked ?i)
        )
    )

    (:action wait_boil_water
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (item_in ?i ?ap)
            (appliance_at ?ap ?r)
            (is_stove ?ap)
            (appliance_on ?ap)
            (not (boiled ?i))
        )
        :effect (and
            (boiled ?i)
        )
    )

    (:action wait_cook_ramen
        :parameters (?a - agent ?i - item ?ap - appliance ?r - room)
        :precondition (and
            (agent_at ?a ?r)
            (item_in ?i ?ap)
            (appliance_at ?ap ?r)
            (is_water_dispenser ?ap)
            (appliance_on ?ap)
            (not (cooked ?i))
        )
        :effect (and
            (cooked ?i)
        )
    )
    ; End actions
)

; problem
(define (problem dualdeskroom_housework)
    (:domain housework)

    ; Begin objects
    (:objects
        robot - agent
        dualdeskroom - room
        bread kettle cup_ramen - item
        toaster stove water_dispenser - appliance
        dualdesk_1 dualdesk_2 - desk
    )

    ; Begin init
    (:init
        ; Connections
        ; (No neighbors in this scene graph)

        ; Positions
        (agent_at robot dualdeskroom)
        (agent_hand_free robot)
        (item_at bread dualdeskroom)
        (item_at kettle dualdeskroom)
        (item_at cup_ramen dualdeskroom)
        (item_at dualdesk_1 dualdeskroom)
        (item_at dualdesk_2 dualdeskroom)
        (appliance_at toaster dualdeskroom)
        (appliance_at stove dualdeskroom)
        (appliance_at water_dispenser dualdeskroom)

        ; Attributes
        (item_accessible bread)
        (item_pickable bread)
        (item_accessible toaster)
        (item_accessible kettle)
        (item_pickable kettle)
        (item_accessible stove)
        (item_accessible cup_ramen)
        (item_pickable cup_ramen)
        (item_accessible water_dispenser)
        (item_accessible dualdesk_1)
        (item_accessible dualdesk_2)

        (is_bread bread)
        (is_toaster toaster)
        (is_kettle kettle)
        (is_stove stove)
        (is_cup_ramen cup_ramen)
        (is_water_dispenser water_dispenser)
        (is_desk dualdesk_1)
        (is_desk dualdesk_2)
    )
    ; End init

    ; Begin goal
    (:goal (and
        (cooked bread)
        (item_on bread dualdesk_1)
        (boiled kettle)
        (item_on kettle dualdesk_1)
        (cooked cup_ramen)
        (item_on cup_ramen dualdesk_1)
    ))
    ; End goal
)

; plan
1. (turn_on_appliance robot water_dispenser dualdeskroom)
   added: (appliance_on water_dispenser)
   goals met: 0 of 6
2. (pick_from_room robot bread dualdeskroom)
   deleted: (item_at bread dualdeskroom) (agent_hand_free robot)
   added: (agent_has_item robot bread)
   goals met: 0 of 6
3. (place_in_appliance robot bread water_dispenser dualdeskroom)
   deleted: (agent_has_item robot bread)
   added: (agent_hand_free robot) (item_in bread water_dispenser)
   goals met: 0 of 6
4. (wait_cook_ramen robot bread water_dispenser dualdeskroom)
   added: (cooked bread)
   goals met: 1 of 6
5. (pick_from_appliance robot bread water_dispenser dualdeskroom)
   deleted: (item_in bread water_dispenser) (agent_hand_free robot)
   added: (agent_has_item robot bread)
   goals met: 1 of 6
6. (place_on_desk robot bread dualdesk_1 dualdeskroom)
   deleted: (agent_has_item robot bread)
   added: (agent_hand_free robot) (item_on bread dualdesk_1)
   goals met: 2 of 6
7. (turn_on_appliance robot stove dualdeskroom)
   added: (appliance_on stove)
   goals met: 2 of 6
8. (pick_from_room robot kettle dualdeskroom)
   deleted: (item_at kettle dualdeskroom) (agent_hand_free robot)
   added: (agent_has_item robot kettle)
   goals met: 2 of 6
9. (place_in_appliance robot kettle stove dualdeskroom)
   deleted: (agent_has_item robot kettle)
   added: (agent_hand_free robot) (item_in kettle stove)
   goals met: 2 of 6
10. (wait_boil_water robot kettle stove dualdeskroom)
   added: (boiled kettle)
   goals met: 3 of 6
11. (pick_from_appliance robot kettle stove dualdeskroom)
   deleted: (item_in kettle stove) (agent_hand_free robot)
   added: (agent_has_item robot kettle)
   goals met: 3 of 6
12. (place_on_desk robot kettle dualdesk_1 dualdeskroom)
   deleted: (agent_has_item robot kettle)
   added: (agent_hand_free robot) (item_on kettle dualdesk_1)
   goals met: 4 of 6
13. (pick_from_room robot cup_ramen dualdeskroom)
   deleted: (item_at cup_ramen dualdeskroom) (agent_hand_free robot)
   added: (agent_has_item robot cup_ramen)
   goals met: 4 of 6
14. (place_in_appliance robot cup_ramen water_dispenser dualdeskroom)
   deleted: (agent_has_item robot cup_ramen)
   added: (agent_hand_free robot) (item_in cup_ramen water_dispenser)
   goals met: 4 of 6
15. (wait_cook_ramen robot cup_ramen water_dispenser dualdeskroom)
   added: (cooked cup_ramen)
   goals met: 5 of 6
16. (pick_from_appliance robot cup_ramen water_dispenser dualdeskroom)
   deleted: (item_in cup_ramen water_dispenser) (agent_hand_free robot)
   added: (agent_has_item robot cup_ramen)
   goals met: 5 of 6
17. (place_on_desk robot cup_ramen dualdesk_1 dualdeskroom)
   deleted: (agent_has_item robot cup_ramen)
   added: (agent_hand_free robot) (item_on cup_ramen dualdesk_1)
   goals met: 6 of 6
